In [227]:
import pandas as pd
people={
    "first":['Eman','Nada','Hala'],
    "last":['sami','yasser','mourad'],
    "email":['esamy369@gmail','nada3342@gmail','hal232@gmai']
}

In [228]:
df=pd.DataFrame(people)

In [229]:
df

  first    last           email
0  Eman    sami  esamy369@gmail
1  Nada  yasser  nada3342@gmail
2  Hala  mourad     hal232@gmai

Adding and Removing on columns

In [230]:
 # making first and last name together
df['first']+" "+ df['last']

0      Eman sami
1    Nada yasser
2    Hala mourad
dtype: object

In [231]:
 #adding a new column 
df['full_name']=df['first']+" "+df['last']
df

  first    last           email    full_name
0  Eman    sami  esamy369@gmail    Eman sami
1  Nada  yasser  nada3342@gmail  Nada yasser
2  Hala  mourad     hal232@gmai  Hala mourad

In [232]:
 # removing the old two columns
df.drop(columns=['first','last'],inplace=True) 
df

            email    full_name
0  esamy369@gmail    Eman sami
1  nada3342@gmail  Nada yasser
2     hal232@gmai  Hala mourad

In [233]:
# another syntax
# df.drop(["first","last"],axis=1)

In [234]:
 # to split the full_name 
df['full_name'].str.split(" ")

0      [Eman, sami]
1    [Nada, yasser]
2    [Hala, mourad]
Name: full_name, dtype: object

In [235]:
 # to split the full_name to two columns
df['full_name'].str.split(" ",expand=True)
df

            email    full_name
0  esamy369@gmail    Eman sami
1  nada3342@gmail  Nada yasser
2     hal232@gmai  Hala mourad

In [236]:

df[['first','last']]=df['full_name'].str.split(" ",expand=True)

In [237]:
df

            email    full_name first    last
0  esamy369@gmail    Eman sami  Eman    sami
1  nada3342@gmail  Nada yasser  Nada  yasser
2     hal232@gmai  Hala mourad  Hala  mourad

Adding and Removing on rows

In [238]:
 #adding a row
df.append({'first':'tony'},ignore_index=True)

C:\Users\Eman\AppData\Local\Temp\ipykernel_7656\3817692595.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first':'tony'},ignore_index=True)

            email    full_name first    last
0  esamy369@gmail    Eman sami  Eman    sami
1  nada3342@gmail  Nada yasser  Nada  yasser
2     hal232@gmai  Hala mourad  Hala  mourad
3             NaN          NaN  tony     NaN

In [239]:
people={
    "first":['tony','mazen'],
    "last":['khalifa','ahmed'],
    "email":['tony369@gmail','mazen3342@gmail']
}

In [240]:
df2=pd.DataFrame(people)

In [241]:
df2

   first     last            email
0   tony  khalifa    tony369@gmail
1  mazen    ahmed  mazen3342@gmail

In [242]:
 # adding another data
df=df.append(df2,ignore_index=True)
df

C:\Users\Eman\AppData\Local\Temp\ipykernel_7656\190981764.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df.append(df2,ignore_index=True)

             email    full_name  first     last
0   esamy369@gmail    Eman sami   Eman     sami
1   nada3342@gmail  Nada yasser   Nada   yasser
2      hal232@gmai  Hala mourad   Hala   mourad
3    tony369@gmail          NaN   tony  khalifa
4  mazen3342@gmail          NaN  mazen    ahmed

In [247]:
 #removing a row 
df=df.drop(index=3)
df

             email    full_name  first    last
0   esamy369@gmail    Eman sami   Eman    sami
1   nada3342@gmail  Nada yasser   Nada  yasser
2      hal232@gmai  Hala mourad   Hala  mourad
4  mazen3342@gmail          NaN  mazen   ahmed

In [248]:
 #droping using condition (filteration)
df=df.drop(index=df[df['last']=='mourad'].index)
df

             email    full_name  first    last
0   esamy369@gmail    Eman sami   Eman    sami
1   nada3342@gmail  Nada yasser   Nada  yasser
4  mazen3342@gmail          NaN  mazen   ahmed

In [249]:
 # to make it more flexable to be readen
filt=df['last']=='ahmed' 
df[filt]

             email full_name  first   last
4  mazen3342@gmail       NaN  mazen  ahmed

In [252]:
df=df.drop(index=df[filt].index)
df

C:\Users\Eman\AppData\Local\Temp\ipykernel_7656\4022281546.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df=df.drop(index=df[filt].index)

            email    full_name first    last
0  esamy369@gmail    Eman sami  Eman    sami
1  nada3342@gmail  Nada yasser  Nada  yasser